#include <stdio.h>
int f[1000001];
int main ()
{
    int i, n;
    while(scanf("%d",&n) != EOF){
         f[0] = f[1] = 1;
            for (i=2; i<=n; ++i) {
                if (i % 2)
                    f [i] = f[i-1];
                else
                    f [i] = (f[i-1] + f[i/2]) % 1000000000;
            }
            printf ("%d\n", f[n]);
    }
    return 0;
}

/*
    当N等于奇数时2k+1：它拆分的第一项一定是1，把1划了就是对应2k的拆分
    如：5 = 1+1+1+1+1        4 = 1+1+1+1
        5 = 1+1+1+2          4 = 1+1+2
        5 = 1+2+2            4 = 2+2
        5 = 1+4              4 = 4

    对于偶数n = 2k：考虑有1的和没1的，有1的去了和2k-1拆分一一对应 没1的
    将每项除以2，正好一一对于k的所有拆分  因此：f(2k) = f(2k-1) + f(k)
*/
